podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SIM_MKL27Z644.svd.xml
            <register>
               <name>SOPT7</name>
               <description>System Options Register 7\n
Selects 1 of 16 peripherals to initiate an ADC conversion via the ADHWDT input, when ADC0ALTTRGEN =1, else is ignored by ADC0</description>
               <addressOffset>0x1018</addressOffset>
               <fields>
                  <field>
                     <name>ADC0TRGSEL</name>
                     <description>ADC0 Trigger Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>External trigger pin input (EXTRG_IN)</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>CMP0_OUT</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>Reserved</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>Reserved</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>PIT trigger 0</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>PIT trigger 1</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>Reserved</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Reserved</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>TPM0 overflow</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>TPM1 overflow</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>TPM2 overflow</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>Reserved</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>RTC alarm</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>RTC seconds</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>LPTMR0 trigger</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Reserved</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC0PRETRGSEL</name>
                     <description>ADC0 PreTrigger Select\n
Selects the ADC0 pretrigger source when alternative triggers are enabled through ADC0ALTTRGEN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pretrigger ADHDWTSA is selected\n
ADC0 will use ADC0_SC1A configuration for the next ADC conversion and store the result in ADC0_RA register</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pretrigger ADHDWTSB is selected
ADC0 will use ADC0_SC1B configuration for the next ADC conversion and store the result in ADC0_RB register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADC0ALTTRGEN</name>
                     <description>ADC0 Alternate Trigger Enable
Enables alternative conversion triggers for ADC0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ADC ADHWT trigger comes from TPM1 channel 0 and channel 1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ADC ADHWT trigger comes from a peripheral event selected by ADC0TRGSEL bits</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDID</name>
               <description>System Device Identification Register</description>
               <addressOffset>0x1024</addressOffset>
               <access>read-only</access>
               <resetValue>0x100C80</resetValue>
               <fields>
                  <field>
                     <name>PINID</name>
                     <description>Pincount Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>16-pin</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>24-pin</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>32-pin</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>Reserved</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>48-pin</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>64-pin</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>80-pin</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Reserved</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>100-pin</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>Reserved</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>Reserved</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>Reserved</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>Reserved</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>Reserved</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Reserved</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Reserved</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIEID</name>
                     <description>Device Die Number</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>REVID</name>
                     <description>Device Revision Number</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRAMSIZE</name>
                     <description>System SRAM Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>0.5 KB</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>1 KB</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>2 KB</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>4 KB</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>8 KB</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>16 KB</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>32 KB</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>64 KB</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SERIESID</name>
                     <description>Kinetis Series ID</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>KL family</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SUBFAMID</name>
                     <description>Kinetis Sub-Family ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>KLx2 Subfamily (low end)</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>KLx3 Subfamily (low end)</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>KLx4 Subfamily (basic analog)</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>KLx5 Subfamily (advanced analog)</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>KLx6 Subfamily (advanced analog with I2S)</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAMID</name>
                     <description>Kinetis family ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>KL0x Family (low end)</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>KL1x Family (basic)</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>KL2x Family (USB)</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>KL3x Family (Segment LCD)</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>KL4x Family (USB and Segment LCD)</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC4</name>
               <description>System Clock Gating Control Register 4</description>
               <addressOffset>0x1034</addressOffset>
               <resetValue>0xF0000030</resetValue>
               <fields>
                  <field>
                     <name>I2C0</name>
                     <description>I2C0 Clock Gate Control
Controls the clock gate to the I2C0 module</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="I2C0" > <name>I2C1</name> <description>I2C1 Clock Gate Control
Controls the clock gate to the I2C1 module</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="I2C0" > <name>UART2</name> <description>UART2 Clock Gate Control
Controls the clock gate to the UART2 module</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="I2C0" > <name>USBOTG</name> <description>USB Clock Gate Control
This bit controls the clock gate to the USB module</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="I2C0" > <name>CMP0</name> <description>Comparator Clock Gate Control
Controls the clock gate to the comparator module</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="I2C0" > <name>VREF</name> <description>VREF Clock Gate Control\n
Controls the clock gate to the VREF module</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="I2C0" > <name>SPI0</name> <description>SPI0 Clock Gate Control
Controls the clock gate to the SPI0 module</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="I2C0" > <name>SPI1</name> <description>SPI1 Clock Gate Control
Controls the clock gate to the SPI1 module</description> <bitOffset>23</bitOffset> </field>
               </fields>
            </register>
