podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SIM_MKL27Z644.svd.xml
            <register>
               <name>SCGC5</name>
               <description>System Clock Gating Control Register 5</description>
               <addressOffset>0x1038</addressOffset>
               <resetValue>0x182</resetValue>
               <fields>
                  <field>
                     <name>LPTMR</name>
                     <description>Low Power Timer Access Control
Controls software access to the Low Power Timer module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Access disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Access enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PORTA</name>
                     <description>Port A Clock Gate Control
Controls the clock gate to the Port A module</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PORTA" > <name>PORTB</name> <description>Port B Clock Gate Control
Controls the clock gate to the Port B module</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>PORTC</name> <description>Port C Clock Gate Control
Controls the clock gate to the Port C module</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>PORTD</name> <description>Port D Clock Gate Control
Controls the clock gate to the Port D module</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>PORTE</name> <description>Port E Clock Gate Control
Controls the clock gate to the Port E module</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>LPUART0</name> <description>LPUART0 Clock Gate Control
This bit controls the clock gate to the LPUART0 module</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>LPUART1</name> <description>LPUART1 Clock Gate Control
This bit controls the clock gate to the LPUART1 module</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>FLEXIO</name> <description>FLEXIO Clock Gate Control
This bit controls the clock gate to the FlexIO Module</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC6</name>
               <description>System Clock Gating Control Register 6</description>
               <addressOffset>0x103C</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>FTF</name>
                     <description>Flash Clock Gate Control
Controls the clock gate to the flash memory. Flash reads are still supported while the flash memory is
clock gated, but entry into low power modes is blocked</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FTF" > <name>DMAMUX0</name> <description>DMA Mux Clock Gate Control
Controls the clock gate to the DMA Mux module</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>CRC</name> <description>CRC Clock Gate Control
This bit controls the clock gate to the CRC module</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>PIT</name> <description>PIT Clock Gate Control
This bit controls the clock gate to the PIT module</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>TPM0</name> <description>TPM0 Clock Gate Control
Controls the clock gate to the TPM0 module</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>TPM1</name> <description>TPM1 Clock Gate Control
Controls the clock gate to the TPM1 module</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>TPM2</name> <description>TPM2 Clock Gate Control
Controls the clock gate to the TPM2 module</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>ADC0</name> <description>ADC0 Clock Gate Control
Controls the clock gate to the ADC0 module</description> <bitOffset>27</bitOffset> </field>
                  <field>
                     <name>RTC</name>
                     <description>RTC Access Control
Controls software access and interrupts to the RTC module</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Access and interrupts disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Access and interrupts enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC7</name>
               <description>System Clock Gating Control Register 7</description>
               <addressOffset>0x1040</addressOffset>
               <resetValue>0x100</resetValue>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>DMA Clock Gate Control
Controls the clock gate to the DMA module</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKDIV1</name>
               <description>System Clock Divider Register 1</description>
               <addressOffset>0x1044</addressOffset>
               <resetValue>0x10000</resetValue>
               <fields>
                  <field>
                     <name>OUTDIV4</name>
                     <description>Clock 4 Output Divider value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Divide-by-1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Divide-by-2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Divide-by-3</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Divide-by-4</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Divide-by-5</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Divide-by-6</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Divide-by-7</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Divide-by-8</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDIV1</name>
                     <description>Clock 1 Output Divider value</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Divide-by-1</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Divide-by-2</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>Divide-by-3</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>Divide-by-4</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>Divide-by-5</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>Divide-by-6</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>Divide-by-7</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Divide-by-8</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>Divide-by-9</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>Divide-by-10</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>Divide-by-11</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>Divide-by-12</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>Divide-by-13</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>Divide-by-14</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Divide-by-15</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Divide-by-16</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG1</name>
               <description>Flash Configuration Register 1</description>
               <addressOffset>0x104C</addressOffset>
               <resetValue>0xF000000</resetValue>
               <fields>
                  <field>
                     <name>FLASHDIS</name>
                     <description>Flash Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Flash is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Flash is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLASHDOZE</name>
                     <description>Flash Doze</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Flash remains enabled during Doze mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Flash is disabled for the duration of Doze mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFSIZE</name>
                     <description>Program Flash Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>8 KB of program flash memory, 0.25 KB protection region</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>16 KB of program flash memory, 0.5 KB protection region</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>32 KB of program flash memory, 1 KB protection region</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>64 KB of program flash memory, 2 KB protection region</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>128 KB of program flash memory, 4 KB protection region</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>256 KB of program flash memory, 8 KB protection region</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>64 KB of program flash memory, 2 KB protection region</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG2</name>
               <description>Flash Configuration Register 2</description>
               <addressOffset>0x1050</addressOffset>
               <access>read-only</access>
               <resetValue>0x7F800000</resetValue>
               <fields>
                  <field>
                     <name>MAXADDR1</name>
                     <description>This field concatenated with leading zeros plus the value of the MAXADDR1 field indicates the first invalid address of the second program flash block (flash block 1). For example, if MAXADDR0 = MAXADDR1 = 0x10 the first invalid address of flash block 1 is 0x2_0000 + 0x2_0000. This would be the MAXADDR1 value for a device with 256 KB program flash memory across two flash blocks</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>MAXADDR0</name>
                     <description>Max address block</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDMH</name>
               <description>Unique Identification Register Mid-High</description>
               <addressOffset>0x1058</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDML</name>
               <description>Unique Identification Register Mid Low</description>
               <addressOffset>0x105C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDL</name>
               <description>Unique Identification Register Low</description>
               <addressOffset>0x1060</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
